app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "b"], ["created_at", "2022-10-31 23:41:19.222504"], ["updated_at", "2022-10-31 23:41:19.222504"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "bc"], ["updated_at", "2022-11-01 04:50:13.166226"], ["id", 2]]